Revit 2026 API

# StructuralAssetWoodParallelShearStrength Property

---

The parallel shear strength of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double WoodParallelShearStrength { get; set; }
```
```vb
Public Property WoodParallelShearStrength As Double
	Get
	Set
```
```cpp
public:
property double WoodParallelShearStrength {
	double get ();
	void set (double value);
}
```
```fsharp
member WoodParallelShearStrength : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InapplicableDataException | When setting this property: the material type must be wood to set this property. |

Applies to wood-based structural assets. The value is in Newtons per foot meter (N/(ft · m)).

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace